Ortho_App/data/Master_cfd_file_backup/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001;

// p5t1 = Bounding Box : (-0.471004 -0.290112 4) (77.9496 93.931 96.037)

vertices
(
    (-2 -2 0) // Vetrex0
    (80 -2 0) // Vetrex1
    (80 95 0) // Vetrex2
    (-2 95 0) // Vetrex3
    (-2 -2 100) // Vetrex0
    (80 -2 100) // Vetrex1
    (80 95 100) // Vetrex2
    (-2 95 100) // Vetrex3
);

blocks
// lv0 = (x * 1.122) / (1.7^(1/3))
(
    hex (0 1 2 3 4 5 6 7) (78 92 94) simpleGrading (1 1 1)
);

edges
(
);

boundary
(

);

// ************************************************************************* //
