Ortho_App/data/Master_cfd_file_backup/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

#include "pvfr.txt"
//$vfr
//
// txtfile
//(vfr*1.122)/60000;
//#inputMode merge

boundaryField
{
    inlet
    {
        type          pressureInletOutletVelocity;
        value         uniform (0 0 0);
    }

    wall
    {
        type            noSlip;
    }

    outlet
    {
        type            flowRateOutletVelocity;
        //massFlowRate    constant $vfr;
        massFlowRate    constant 0.0005608; // 40LPM = 0.0007478; // 30LPM = 0.0005608;
        rhoOutlet       1.122;
    }
}

// ************************************************************************* //
