Ortho_App/data/Master_cfd_file_backup/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 84694.93;

boundaryField
{
    inlet
    {
        //type            zeroGradient;
        type            totalPressure;
        rho             none;
        p0              uniform 84694.93;
        value           $internalField;
    }

    wall
    {
        type            zeroGradient;
    }

    outlet
    {
        type            zeroGradient;
        //type            fixedValue;
        //value           uniform 0;
    }
}

// ************************************************************************* //
